set BUFF_CELL      {DLY2X0P5MA10TR DLY4X0P5MA10TR FRICGX0P5BA10TR FRICGX0P6BA10TR FRICGX0P7BA10TR FRICGX0P8BA10TR FRICGX1BA10TR FRICGX1P2BA10TR FRICGX1P4BA10TR FRICGX1P7BA10TR FRICGX2BA10TR FRICGX2P5BA10TR FRICGX3BA10TR FRICGX3P5BA10TR FRICGX4BA10TR FRICGX5BA10TR FRICGX6BA10TR FRICGX7P5BA10TR FRICGX9BA10TR FRICGX11BA10TR FRICGX13BA10TR FRICGX16BA10TR BUFHX0P7MA10TR BUFHX0P8MA10TR BUFHX1MA10TR BUFHX1P2MA10TR BUFHX1P4MA10TR BUFHX1P7MA10TR BUFHX2MA10TR BUFHX2P5MA10TR BUFHX3MA10TR BUFHX3P5MA10TR BUFHX4MA10TR BUFHX5MA10TR BUFHX6MA10TR BUFHX7P5MA10TR BUFHX9MA10TR BUFHX11MA10TR BUFHX13MA10TR BUFHX16MA10TR BUFX0P7BA10TR BUFX0P7MA10TR BUFX0P8BA10TR BUFX0P8MA10TR BUFX1BA10TR BUFX1MA10TR BUFX1P2BA10TR BUFX1P2MA10TR BUFX1P4BA10TR BUFX1P4MA10TR BUFX1P7BA10TR BUFX1P7MA10TR BUFX2BA10TR BUFX2MA10TR BUFX2P5BA10TR BUFX2P5MA10TR BUFX3BA10TR BUFX3MA10TR BUFX3P5BA10TR BUFX3P5MA10TR BUFX4BA10TR BUFX4MA10TR BUFX5BA10TR BUFX5MA10TR BUFX6BA10TR BUFX6MA10TR BUFX7P5BA10TR BUFX7P5MA10TR BUFX9BA10TR BUFX9MA10TR BUFX11BA10TR BUFX11MA10TR BUFX13BA10TR BUFX13MA10TR BUFX16BA10TR BUFX16MA10TR}
set INV_CELL       {INVX0P5BA10TR INVX0P5MA10TR INVX0P6BA10TR INVX0P6MA10TR INVX0P7BA10TR INVX0P7MA10TR INVX0P8BA10TR INVX0P8MA10TR INVX11BA10TR INVX11MA10TR INVX13BA10TR INVX13MA10TR INVX16BA10TR INVX16MA10TR INVX1BA10TR INVX1MA10TR INVX1P2BA10TR INVX1P2MA10TR INVX1P4BA10TR INVX1P4MA10TR INVX1P7BA10TR INVX1P7MA10TR INVX2BA10TR INVX2MA10TR INVX2P5BA10TR INVX2P5MA10TR INVX3BA10TR INVX3MA10TR INVX3P5BA10TR INVX3P5MA10TR INVX4BA10TR INVX4MA10TR INVX5BA10TR INVX5MA10TR INVX6BA10TR INVX6MA10TR INVX7P5BA10TR INVX7P5MA10TR INVX9BA10TR INVX9MA10TR}
set DELAY_CELL     {BUFHX0P7MA10TR BUFHX0P8MA10TR BUFHX11MA10TR BUFHX13MA10TR BUFHX16MA10TR BUFHX1MA10TR BUFHX1P2MA10TR BUFHX1P4MA10TR BUFHX1P7MA10TR BUFHX2MA10TR BUFHX2P5MA10TR BUFHX3MA10TR BUFHX3P5MA10TR BUFHX4MA10TR BUFHX5MA10TR BUFHX6MA10TR BUFHX7P5MA10TR BUFHX9MA10TR BUFX0P7BA10TR BUFX0P7MA10TR BUFX0P8BA10TR BUFX0P8MA10TR BUFX11BA10TR BUFX11MA10TR BUFX13BA10TR BUFX13MA10TR BUFX16BA10TR BUFX16MA10TR BUFX1BA10TR BUFX1MA10TR BUFX1P2BA10TR BUFX1P2MA10TR BUFX1P4BA10TR BUFX1P4MA10TR BUFX1P7BA10TR BUFX1P7MA10TR BUFX2BA10TR BUFX2MA10TR BUFX2P5BA10TR BUFX2P5MA10TR BUFX3BA10TR BUFX3MA10TR BUFX3P5BA10TR BUFX3P5MA10TR BUFX4BA10TR BUFX4MA10TR BUFX5BA10TR BUFX5MA10TR BUFX6BA10TR BUFX6MA10TR BUFX7P5BA10TR BUFX7P5MA10TR BUFX9BA10TR BUFX9MA10TR DLY2X0P5MA10TR DLY4X0P5MA10TR FRICGX0P5BA10TR FRICGX0P6BA10TR FRICGX0P7BA10TR FRICGX0P8BA10TR FRICGX11BA10TR FRICGX13BA10TR FRICGX16BA10TR FRICGX1BA10TR FRICGX1P2BA10TR FRICGX1P4BA10TR FRICGX1P7BA10TR FRICGX2BA10TR FRICGX2P5BA10TR FRICGX3BA10TR FRICGX3P5BA10TR FRICGX4BA10TR FRICGX5BA10TR FRICGX6BA10TR FRICGX7P5BA10TR FRICGX9BA10TR INVX0P5BA10TR INVX0P5MA10TR INVX0P6BA10TR INVX0P6MA10TR INVX0P7BA10TR INVX0P7MA10TR INVX0P8BA10TR INVX0P8MA10TR INVX11BA10TR INVX11MA10TR INVX13BA10TR INVX13MA10TR INVX16BA10TR INVX16MA10TR INVX1BA10TR INVX1MA10TR INVX1P2BA10TR INVX1P2MA10TR INVX1P4BA10TR INVX1P4MA10TR INVX1P7BA10TR INVX1P7MA10TR INVX2BA10TR INVX2MA10TR INVX2P5BA10TR INVX2P5MA10TR INVX3BA10TR INVX3MA10TR INVX3P5BA10TR INVX3P5MA10TR INVX4BA10TR INVX4MA10TR INVX5BA10TR INVX5MA10TR INVX6BA10TR INVX6MA10TR INVX7P5BA10TR INVX7P5MA10TR INVX9BA10TR INVX9MA10TR}
set FILLCAP_CELL   {FILL1A10TR FILLTIE2A10TR FILLCAP3A10TR FILLCAP4A10TR FILLCAP8A10TR FILLCAP16A10TR FILLCAP32A10TR FILLCAP64A10TR FILLCAP128A10TR}
set INCPHY_CELL    {FILLCAP3A10TR FILLCAP4A10TR FILLCAP8A10TR FILLCAP16A10TR FILLCAP32A10TR FILLCAP64A10TR FILLCAP128A10TR}
set EXCPHY_CELL    {FILL128A10TR FILLTIE128A10TR FILL64A10TR FILLTIE64A10TR FILL32A10TR FILLTIE32A10TR FILL16A10TR FILLTIE16A10TR FILL8A10TR FILLTIE8A10TR FILL4A10TR FILLTIE4A10TR FILL2A10TR FILLTIE2A10TR FILL1A10TR}

set_ccopt_property buffer_cells                        $BUFF_CELL
set_ccopt_property inverter_cells                      $INV_CELL
setAddRingMode -avoid_short                            true
setAnalysisMode -analysisType                          onChipVariation
setAnalysisMode -cppr                                  both
setAnalysisMode -timeBorrowing                         true
setAnalysisMode -usefulSkew                            true
setDelayCalMode -accuracy_level                        4
setDelayCalMode -engine                                aae
setDelayCalMode -SIAware                               true
setDelayCalMode -socv_accuracy_mode                    ultra
setDesignMode -flowEffort                              extreme
setDesignMode -powerEffort                             none
setDesignMode -process                                 65
setDesignMode -topRoutingLayer                         M7
setDesignMode -congEffort                              high
setExtractRCMode -effortLevel                          signoff
# setExtractRCMode -effortLevel                          low
setExtractRCMode -defViaCap                            true
setExtractRCMode -engine                               preRoute
setFPlanMode -enableRectilinearDesign                  true
setNanoRouteMode -drouteAutoStop                       false
setNanoRouteMode -drouteFixAntenna                     true
setNanoRouteMode -droutePostRouteSwapVia               true
setNanoRouteMode -droutePostRouteViaPillarEffort       high
setNanoRouteMode -drouteSignOffEffort                  high
setNanoRouteMode -drouteUseMultiCutViaEffort           high
setNanoRouteMode -drouteUseViaOfCut                    2
setNanoRouteMode -routeWithLithoDriven                 true
setNanoRouteMode -routeWithSIDriven                    true
setNanoRouteMode -routeWithTimingDriven                true
setOptMode -allEndPoints                               true
setOptMode -drcMargin                                  0.1
setOptMode -expExtremeHighEffOpt                       true
setOptMode -fixCap                                     true
setOptMode -fixDrc                                     true
setOptMode -fixFanoutLoad                              true
setOptMode -fixSISlew                                  true
setOptMode -fixTran                                    true
setOptMode -holdTargetSlack                            0.002
setOptMode -optimizeFF                                 true
setOptMode -postRouteAreaReclaim                       holdAndSetupAware
setOptMode -postRouteHoldRecovery                      auto
setOptMode -postRouteDrvRecovery                       true
setOptMode -powerEffort                                none
setOptMode -reclaimArea                                true
setOptMode -reclaimRestructuringEffort                 high
setOptMode -setupTargetSlack                           0.002
setOptMode -setupTargetSlackForReclaim                 0.001
setOptMode -simplifyNetlist                            true
setOptMode -timeDesignCompressReports                  false
setOptMode -usefulSkew                                 true
setOptMode -usefulSkewCCOpt                            extreme
setPlaceMode -place_detail_check_route                 true
setPlaceMode -place_detail_irdrop_aware_effort         high
setPlaceMode -place_detail_irdrop_aware_timing_effort  high
setPlaceMode -place_detail_swap_eeq_cells              true
setPlaceMode -place_detail_wire_length_opt_effort      high
setPlaceMode -place_global_clock_power_driven_effort   high
setPlaceMode -place_global_cong_effort                 high
setPlaceMode -place_global_ignore_scan                 true
setPlaceMode -place_global_ignore_spare                true
setPlaceMode -place_global_timing_effort               high
setRouteMode -earlyGlobalHonorMsvRouteConstraint       true
setRouteMode -earlyGlobalRoutePartitionPinGuide        true
setUsefulSkewMode -maxAllowedDelay                     2
setUsefulSkewMode -useCells                            $DELAY_CELL
setViaGenMode -add_pin_to_pin_via                      true
setViaGenMode -align_merged_stack_via_metals           true
setViaGenMode -create_double_row_cut_via               1
setViaGenMode -create_max_row_cut_via                  true
setViaGenMode -full_cut_via_only                       true
setViaGenMode -invoke_verifyGeometry                   true
setViaGenMode -respect_signal_routes                   2
setViaGenMode -respect_stdcell_geometry                true

setLayerPreference M9 -isVisible 0
setLayerPreference VIA8 -isVisible 0
setLayerPreference M8 -isVisible 0
setLayerPreference VIA7 -isVisible 0
setLayerPreference M7 -isVisible 0
setLayerPreference VIA6 -isVisible 0
setLayerPreference M6 -isVisible 0
setLayerPreference VIA5 -isVisible 0

proc connectGlobalNets {} {
	globalNetConnect VDD -pin VDDPE -singleInstance example_sram_
	globalNetConnect VDD -pin VDDCE -singleInstance example_sram_
	globalNetConnect VSS -pin VSSE -singleInstance example_sram_
	globalNetConnect VDD -type pgpin -pin VDD -all
	globalNetConnect VSS -type pgpin -pin VSS -all
	globalNetConnect VDD -type tiehi -all
	globalNetConnect VSS -type tielo -all
	applyGlobalNets
}

source "scripts/innovus_timing.tcl"
